week5/w5d1/dreams_app/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id
    if @comment.save
---
INSERT INTO "comments" ("body", "spooky", "commentable_type", "commentable_id", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)