week5/w5d1/dreams_app/app/controllers/dreams_controller.rb

  def create
    @dream = Dream.new(dream_params)
    @dream.user_id = current_user.id
    if @dream.save
---
INSERT INTO "dreams" ("title", "content", "completeness", "spooky", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "walter"], ["content", "fucked up"], ["completeness", 100], ["spooky", "t"], ["user_id", 1], ["created_at", "2015-09-22 00:00:04.587889"], ["updated_at", "2015-09-22 00:00:04.587889"]]

  def index
    @dreams = Dream.includes(:user).all
---
SELECT "dreams".* FROM "dreams"
SELECT "users".* FROM "users" WHERE "users"."id" IN (1)

  def edit
    @dream = Dream.find(params[:id])
---
SELECT  "dreams".* FROM "dreams" WHERE "dreams"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @dream = Dream.find(params[:id])
    if @dream.update(dream_params)
---
SELECT  "dreams".* FROM "dreams" WHERE "dreams"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "dreams" SET "title" = ?, "updated_at" = ? WHERE "dreams"."id" = ?  [["title", "Umasdf"], ["updated_at", "2015-09-21 22:13:08.393875"], ["id", 1]]

  def show
    @dream = Dream.find(params[:id])
---
SELECT  "dreams".* FROM "dreams" WHERE "dreams"."id" = ? LIMIT 1  [["id", 1]]