week5/w5d1/dreams_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "dreams".* FROM "dreams" WHERE "dreams"."user_id" IN (1)
---
  def show
    @user = User.includes(:dreams).find(params[:id])