week4/w4d3/99cats_auth/app/views/cats/show.html.erb

  <% if @cat.user_id == current_user.id %>
    <% @cat.rental_requests.order("start_date").each do |req| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."cat_id" = $1  ORDER BY start_date  [["cat_id", 1]]