week4/w4d1/app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)
    if @contact.save
---
INSERT INTO "contacts" ("email", "name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "HarryPotter@hogwarts.edu"], ["name", "hPSON"], ["user_id", 2], ["created_at", "2015-09-14 22:26:28.420381"], ["updated_at", "2015-09-14 22:26:28.420381"]]

  def show
    render json: Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 4]]